# -*- coding: utf-8 -*-
# # 1 - 1. Присвоїти цілій змінній h третю з кінця цифру в записі додатного цілого числа k
# (наприклад, якщо k  130985 , то h  9 ). Вивести k та h
# k = str (input ('k = '))
# if k < 3:
#     print "Too small number"
# else:
#     print 'h = ', k[2]


# # 2 - Присвоїти цілій змінній d першу цифру з дробової частини додатного дробового числа
# # x (так, якщо x  32 . 597 , то d  5 ). Вивести x та d.
# x = float(input('x = '))
# print  'x = ', x
# x = '%.1f' % x
# print 'b = ', x[-1]



# # 3 - Цілій змінній s присвоїти суму цифр трьохзначного цілого числа числа k . Вивести s та
# k.
# n = int(input('k = '))
# print sum([int(n) for n in str(n)])


# 4 - Йде k  а секунда доби. Визначити, скільки повних годин  h  і повних хвилин  m 
# пройшло до цього моменту (наприклад, h  3 і m  40 , якщо
# k  13257  3  3600  40  60  57 ).
# k = 53421
# h = k//3600
# m = (k-h*3600)//60
# print "h =", h, "год"
# print "m = ", m, "хв"


# 5 -



# 6 -





# 7 - Нехай k - ціле від 1 до 365. Присвоїти цілій змінній n значення 1, 2,...,6 чи 7 залежно від
# того , на який день тижня (понеділок, вівторок, ..., суботу чи неділю) припадає k -й день
# не високосного року, в якому 1 січня - понеділок.
# k = int(input('k = '))
# K = ("Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця", "Субота", "Неділя" )
# if 0<k<8:
#     print k, K[k-1]
# elif 7<k<356:
#     print k % 7, K[k%7-1]
# else:
#     print "Введіть число менше 365"




# #8 - Поміняти місцями значення цілих змінних x і y , не використовуючи додаткові змінні.
# a = 5
# b = 3
# a, b = b, a
# print "a =", a, "b =",  b



# # # 9. Обчислити довжину кола, площу круга і об’єм кулі одного і того ж заданого радіуса R;
# # Довжина кола С= 2ПR
# # Площа круга S = П R**2
# # Обєм кулі V = 4/3 П R**3
# import math
# R = 3
# C = 2 * math.pi * R
# S = math.pi * (R**2)
# V = (4/3) * math.pi * (R**3)
# print "Довжина кола C =", C
# print "Площа круга S=", S
# print "Обєм кулі V=", V



# #10 - Знайти добуток цифр заданого чотиризначного числа;
# n = int(input())
# mult = 1
# while n:
#     d = n%10
#     mult = mult * d
#     n = n / 10
# print "Добуток  = ", mult



# 11. Визначити число, яке отримано виписуванням в оберненому порядку цифр заданого
# # трьохзначного числа.
# x = 354
# y = str(x)
# print "y =", y[::-1]




# #12 - Для довільних дійсних чисел a, b, і c визначити, чи має рівняння ax2+bx+c=0 хоча б один
# дійсний корінь і якщо так, то видрукувати його.
# import math
# a = int(input( "a = "))
# b = int(input( "b = "))
# c = int(input( "c = "))
# # print a * (x **2) + (b * x) + c=0
# print a, "* (x**2) + (", b, "*x) +", c, "=0"
# D = (b**2) - (4*a*c)
# if D > 0:
#    print (b + D**0.5) / 2*a and (b - math.sqrt(D)) / 2*a
# elif D == 0:
#    print b / (2*a)
# elif D < 0:
#    print "No solutions"



# 13 - Визначити, чи рівна сума двох перших цифр заданого чотиризначного числа сумі двох
#  його останніх цифр; Якщо так, то видрукувати цю суму.
# x = 3214
# y = str(x)
# if int(y[0]) + int(y[1]) == int(y[2]) + int(y[3]):
#     print int(y[0]) + int(y[1]) or int(y[2]) + int(y[3])




# 14 - Визначити, чи рівний квадрат заданого трьохзначного числа кубу суми цифр цього
# числа;
# x = 132
# if x**2 == ((x//100) + (x %100)//10 + ((x%100)%10)//1)**3:
#     print x**2
# else:
#     print "Incorrect"




# #15 - Визначити, чи є серед цифр заданого трьохзначного числа одинакові; Якщо є –
# видрукувати їх.
#
# x = 232
# y = str(x)
# if y[0] == y[1]:
#     print y[0], y[1]
# elif y[0] == y[2]:
#     print y[0], y[2]
# elif y[1] == y[2]:
#     print y[1], y[2]



#16



# #17 - Знайти добуток цифр заданого натурального трьохзначного числа;
# x = 355
# my_product = 1
# while x:
#     print "x:", x,
#     d = x%10
#     print "d:", d,
#     my_product *= d
#     x = x/10
#     print " => x:", x
# print "my_product:", my_product




